results/test1/file/a/fio-512.txt
random-write: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
Jobs: 4 (f=4): [w(4)][100.0%][w=3014KiB/s][w=6029 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1099: Sat Mar 16 19:01:11 2024
  write: IOPS=1694, BW=847KiB/s (868kB/s)(49.7MiB/60041msec); 0 zone resets
    slat (nsec): min=251, max=46229k, avg=67611.40, stdev=375624.19
    clat (nsec): min=551, max=816616k, avg=4519187.05, stdev=47978123.80
     lat (usec): min=20, max=816620, avg=4586.80, stdev=47978.50
    clat percentiles (nsec):
     |  1.00th=[     1112],  5.00th=[     5920], 10.00th=[    61184],
     | 20.00th=[   232448], 30.00th=[   333824], 40.00th=[   428032],
     | 50.00th=[   528384], 60.00th=[   659456], 70.00th=[   847872],
     | 80.00th=[  1155072], 90.00th=[  1843200], 95.00th=[  2834432],
     | 99.00th=[ 17694720], 99.50th=[383778816], 99.90th=[725614592],
     | 99.95th=[750780416], 99.99th=[767557632]
   bw (  KiB/s): min=    1, max= 2091, per=31.35%, avg=1016.65, stdev=523.96, samples=100
   iops        : min=    2, max= 4183, avg=2033.42, stdev=1047.99, samples=100
  lat (nsec)   : 750=0.43%, 1000=0.37%
  lat (usec)   : 2=1.61%, 4=1.84%, 10=2.12%, 20=1.59%, 50=1.77%
  lat (usec)   : 100=1.54%, 250=10.67%, 500=25.76%, 750=17.68%, 1000=10.27%
  lat (msec)   : 2=15.59%, 4=5.89%, 10=1.60%, 20=0.32%, 50=0.31%
  lat (msec)   : 100=0.05%, 250=0.03%, 500=0.11%, 750=0.40%, 1000=0.05%
  cpu          : usr=1.96%, sys=31.95%, ctx=211819, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.9%, 4=54.0%, 8=40.4%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.9%, 8=4.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,101747,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1100: Sat Mar 16 19:01:11 2024
  write: IOPS=1526, BW=763KiB/s (781kB/s)(44.7MiB/60040msec); 0 zone resets
    slat (nsec): min=431, max=38439k, avg=75526.91, stdev=393106.14
    clat (nsec): min=571, max=810740k, avg=5011275.30, stdev=50543716.43
     lat (usec): min=20, max=810745, avg=5086.80, stdev=50542.84
    clat percentiles (nsec):
     |  1.00th=[     1384],  5.00th=[     7840], 10.00th=[   197632],
     | 20.00th=[   305152], 30.00th=[   419840], 40.00th=[   501760],
     | 50.00th=[   618496], 60.00th=[   757760], 70.00th=[   962560],
     | 80.00th=[  1286144], 90.00th=[  2056192], 95.00th=[  3096576],
     | 99.00th=[ 19529728], 99.50th=[517996544], 99.90th=[725614592],
     | 99.95th=[750780416], 99.99th=[775946240]
   bw (  KiB/s): min=    1, max= 1611, per=28.24%, avg=915.51, stdev=435.64, samples=100
   iops        : min=    2, max= 3222, avg=1831.18, stdev=871.32, samples=100
  lat (nsec)   : 750=0.21%, 1000=0.26%
  lat (usec)   : 2=1.34%, 4=1.88%, 10=1.89%, 20=1.46%, 50=1.60%
  lat (usec)   : 100=0.38%, 250=6.07%, 500=24.72%, 750=19.46%, 1000=12.11%
  lat (msec)   : 2=18.21%, 4=6.99%, 10=1.99%, 20=0.43%, 50=0.29%
  lat (msec)   : 100=0.04%, 250=0.03%, 500=0.12%, 750=0.44%, 1000=0.06%
  cpu          : usr=1.83%, sys=36.92%, ctx=194708, majf=0, minf=0
  IO depths    : 1=0.7%, 2=4.9%, 4=54.0%, 8=40.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.9%, 8=4.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,91623,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1101: Sat Mar 16 19:01:11 2024
  write: IOPS=1743, BW=872KiB/s (893kB/s)(51.1MiB/60040msec); 0 zone resets
    slat (nsec): min=440, max=41057k, avg=68577.68, stdev=357923.31
    clat (nsec): min=541, max=814802k, avg=4384728.88, stdev=47292904.37
     lat (usec): min=17, max=814940, avg=4453.31, stdev=47292.32
    clat percentiles (nsec):
     |  1.00th=[     1096],  5.00th=[     5536], 10.00th=[    44288],
     | 20.00th=[   226304], 30.00th=[   321536], 40.00th=[   419840],
     | 50.00th=[   509952], 60.00th=[   643072], 70.00th=[   823296],
     | 80.00th=[  1138688], 90.00th=[  1794048], 95.00th=[  2736128],
     | 99.00th=[ 16187392], 99.50th=[350224384], 99.90th=[725614592],
     | 99.95th=[750780416], 99.99th=[767557632]
   bw (  KiB/s): min=    1, max= 2286, per=32.93%, avg=1067.19, stdev=501.51, samples=98
   iops        : min=    2, max= 4573, avg=2134.54, stdev=1003.05, samples=98
  lat (nsec)   : 750=0.47%, 1000=0.35%
  lat (usec)   : 2=1.57%, 4=2.02%, 10=2.16%, 20=1.62%, 50=1.99%
  lat (usec)   : 100=1.53%, 250=10.98%, 500=26.19%, 750=17.44%, 1000=10.05%
  lat (msec)   : 2=15.25%, 4=5.66%, 10=1.52%, 20=0.32%, 50=0.28%
  lat (msec)   : 100=0.04%, 250=0.02%, 500=0.11%, 750=0.39%, 1000=0.05%
  cpu          : usr=1.99%, sys=32.65%, ctx=212788, majf=0, minf=0
  IO depths    : 1=0.7%, 2=5.3%, 4=55.2%, 8=38.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.6%, 8=4.4%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,104664,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1102: Sat Mar 16 19:01:11 2024
  write: IOPS=1517, BW=759KiB/s (777kB/s)(44.5MiB/60042msec); 0 zone resets
    slat (nsec): min=250, max=49268k, avg=66947.71, stdev=408791.46
    clat (nsec): min=551, max=816806k, avg=5073954.49, stdev=50669664.23
     lat (usec): min=20, max=816811, avg=5140.90, stdev=50667.74
    clat percentiles (nsec):
     |  1.00th=[     1480],  5.00th=[     9408], 10.00th=[   207872],
     | 20.00th=[   309248], 30.00th=[   423936], 40.00th=[   501760],
     | 50.00th=[   618496], 60.00th=[   757760], 70.00th=[   954368],
     | 80.00th=[  1302528], 90.00th=[  2039808], 95.00th=[  3162112],
     | 99.00th=[ 22413312], 99.50th=[526385152], 99.90th=[725614592],
     | 99.95th=[750780416], 99.99th=[775946240]
   bw (  KiB/s): min=    2, max= 1609, per=27.81%, avg=901.10, stdev=444.05, samples=101
   iops        : min=    4, max= 3218, avg=1802.31, stdev=888.12, samples=101
  lat (nsec)   : 750=0.22%, 1000=0.22%
  lat (usec)   : 2=1.30%, 4=1.77%, 10=1.61%, 20=1.15%, 50=1.50%
  lat (usec)   : 100=0.35%, 250=6.35%, 500=25.33%, 750=19.92%, 1000=11.90%
  lat (msec)   : 2=18.02%, 4=6.81%, 10=2.05%, 20=0.41%, 50=0.38%
  lat (msec)   : 100=0.04%, 250=0.03%, 500=0.12%, 750=0.45%, 1000=0.06%
  cpu          : usr=1.84%, sys=36.47%, ctx=193345, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.3%, 4=53.1%, 8=42.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.3%, 8=3.7%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,91088,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=3240KiB/s (3318kB/s), 759KiB/s-872KiB/s (777kB/s-893kB/s), io=190MiB (199MB), run=60040-60042msec